build_config: {"input_shape":[null,28,28]}
class_name: "Sequential"
compile_config: {"jit_compile":false,"loss":"sparse_categorical_crossentropy","loss_weights":null,"metrics":["accuracy"],"run_eagerly":false,"steps_per_execution":1,"weighted_metrics":null}
config: {"build_input_shape":[null,28,28],"dtype":{"class_name":"DTypePolicy","config":{"name":"float32"},"module":"keras","registered_name":null},"layers":[{"class_name":"InputLayer","config":{"batch_shape":[null,28,28],"dtype":"float32","name":"input_layer","sparse":false},"module":"keras.layers","registered_name":null},{"build_config":{"input_shape":[null,28,28]},"class_name":"Flatten","config":{"data_format":"channels_last","dtype":{"class_name":"DTypePolicy","config":{"name":"float32"},"module":"keras","registered_name":null},"name":"flatten","trainable":true},"module":"keras.layers","registered_name":null},{"build_config":{"input_shape":[null,784]},"class_name":"Dense","config":{"activation":"relu","bias_constraint":null,"bias_initializer":{"class_name":"Zeros","config":{},"module":"keras.initializers","registered_name":null},"bias_regularizer":null,"dtype":{"class_name":"DTypePolicy","config":{"name":"float32"},"module":"keras","registered_name":null},"kernel_constraint":null,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"module":"keras.initializers","registered_name":null},"kernel_regularizer":null,"name":"dense","trainable":true,"units":128,"use_bias":true},"module":"keras.layers","registered_name":null},{"class_name":"Dropout","config":{"dtype":{"class_name":"DTypePolicy","config":{"name":"float32"},"module":"keras","registered_name":null},"name":"dropout","noise_shape":null,"rate":0.2,"seed":null,"trainable":true},"module":"keras.layers","registered_name":null},{"build_config":{"input_shape":[null,128]},"class_name":"Dense","config":{"activation":"softmax","bias_constraint":null,"bias_initializer":{"class_name":"Zeros","config":{},"module":"keras.initializers","registered_name":null},"bias_regularizer":null,"dtype":{"class_name":"DTypePolicy","config":{"name":"float32"},"module":"keras","registered_name":null},"kernel_constraint":null,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null},"module":"keras.initializers","registered_name":null},"kernel_regularizer":null,"name":"dense_1","trainable":true,"units":10,"use_bias":true},"module":"keras.layers","registered_name":null}],"name":"sequential","trainable":true}
module: "keras"
registered_name: null
